<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [65]:
!pip install sqlalchemy==1.3.9

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: sqlalchemy==1.3.9 in /usr/local/lib/python3.10/dist-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [66]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [67]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [68]:
# !pip install -q pandas==1.1.5

In [69]:
%sql sqlite:///my_data1.db

In [70]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

999

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [71]:
%%sql 
SELECT DISTINCT(LAUNCH_SITE)
FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('VAFB SLC-4E',),
 ('KSC LC-39A',),
 ('CCAFS SLC-40',),
 (None,)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [72]:
%%sql 
SELECT LAUNCH_SITE 
FROM SPACEXTBL 
WHERE LAUNCH_SITE 
LIKE 'CCA%' 
LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [73]:
%%sql 
SELECT SUM(PAYLOAD_MASS__KG_) as PAYLOAD_MASS_SUM  
FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[(619967.0,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [74]:
%%sql 
SELECT AVG(PAYLOAD_MASS__KG_) as PAYLOAD_MASS_AVG
FROM SPACEXTBL

 * sqlite:///my_data1.db
Done.

[(6138.287128712871,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [75]:
%%sql 
SELECT MIN(DATE) AS first_succesful_landing
FROM SPACEXTBL;

 * sqlite:///my_data1.db
Done.

[('01/06/2014',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [76]:
%%sql 
SELECT BOOSTER_VERSION 
FROM SPACEXTBL 
WHERE LANDING_OUTCOME='Success (drone ship)' and PAYLOAD_MASS__KG_ BETWEEN 4000 and 6000

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [77]:
%%sql 
SELECT COUNT(MISSION_OUTCOME) as mission_outcomes 
FROM SPACEXTBL 
GROUP BY MISSION_OUTCOME;

 * sqlite:///my_data1.db
Done.

[(0,), (1,), (98,), (1,), (1,)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [78]:
%%sql 
SELECT BOOSTER_VERSION AS booster_version 
FROM SPACEXTBL 
WHERE PAYLOAD_MASS__KG_=(select max(PAYLOAD_MASS__KG_) from SPACEXTBL)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [79]:
%%sql 
SELECT substr(Date, 4, 2) as 'month names' ,landing_outcome as 'landing_outcome',BOOSTER_VERSION,LAUNCH_SITE 
FROM SPACEXTBL 
WHERE  substr(Date,7,4)='2015' AND  landing_outcome='Failure (drone ship)'

 * sqlite:///my_data1.db
Done.

[('10', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('04', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

In [80]:
%%sql 
SELECT  DATE,MISSION_OUTCOME,BOOSTER_VERSION, LAUNCH_SITE 
from SPACEXTBL 
WHERE EXTRACT(YEAR FROM DATE)='2015';

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: SELECT  DATE,MISSION_OUTCOME,BOOSTER_VERSION, LAUNCH_SITE
from SPACEXTBL
WHERE EXTRACT(YEAR FROM DATE)='2015';]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Task 10




##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [81]:
%%sql 
SELECT LANDING_OUTCOME 
FROM SPACEXTBL 
WHERE DATE 
BETWEEN '04-06-2010' AND '20-03-2017' 
ORDER BY DATE DESC;

 * sqlite:///my_data1.db
Done.

[('Success (ground pad)',),
 ('No attempt',),
 ('Success',),
 ('Success',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Controlled (ocean)',),
 ('Failure',),
 ('Success',),
 ('Failure',),
 ('Failure (drone ship)',),
 ('Success',),
 ('No attempt',),
 ('Success (ground pad)',),
 ('Success',),
 ('Failure (drone ship)',),
 ('No attempt',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Controlled (ocean)',),
 ('Failure (drone ship)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Failure (parachute)',),
 ('Success',),
 ('Success',),
 ('Failure',),
 ('Success',),
 ('No attempt',),
 ('Success',),
 ('Success',),
 ('Success (drone ship)',),
 ('Success (drone ship)',),
 ('Success',),
 ('No attempt',),
 ('Success',),
 ('Success',),
 ('Success (ground pad)',),
 ('No attempt',),
 ('Success',),
 ('Success',),
 ('Success',),
 ('No attempt ',),
 ('No attempt',),
 ('No attempt',),
 ('Success',),
 ('Success',),
 ('No attempt',),
 ('Failure (parachute)',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('Success (drone ship)',),
 ('Success',),
 ('Success (ground pad)',),
 ('Success (drone ship)',),
 ('No attempt',)]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>